run/StefanProblem/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "(right|left|bottom|top)"
    {
        //type            noSlip;
        type            fixedValue;
        value           $internalField;
    }

    /*
    top
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
        inletValue      $internalField;
    }
    */

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //